---
kind: other
id: Methods.T:Autodesk.Revit.DB.PrimaryDesignOptionMemberFilter
source: html/1b3ff89d-d4d0-a3d7-2629-092981dc4c61.htm
---
# PrimaryDesignOptionMemberFilter Methods

Applies the filter to a given element.